import sqlite3          # SQLite3 탑재


# 데이터 입력 함수
def insert_books():
    conn = sqlite3.connect('my_books.db')  # 데이터베이스 커넥션 생성
    cur = conn.cursor()  # 커서 확보

    # 데이터 입력
    cur.execute("INSERT INTO my_books VALUES ('개발자의 코드', '2013.02.28','A', 200, 0)")

    # 데이터 입력 SQL
    insert_sql = 'INSERT INTO my_books VALUES (?, ?, ?, ?, ?)'

    # 튜플을 이용한 데이터 입력
    cur.execute(insert_sql, ('클린 코드', '2010.03.04','B', 584, 1))

    # 책의 정보를 담고 있는 튜플들의 리스트
    books = [
        ('빅데이터 마케팅', '2014.07.02','A', 296, 1),
        ('구글드', '2010.02.10','B', 526, 0),
        ('강의력', '2013.12.12','A', 248, 1),
        ('베트남가즈아', '2018.09.30','A',111,0),
        ('이어폰 내놔','2018.07.06','A',555,1)
    ]

    # 여러 데이터 입력
    cur.executemany(insert_sql, books)

    conn.commit()       # 데이터베이스 반영

    conn.close()        # 커넥션 닫기


def insert_class():
    conn = sqlite3.connect('my_class.db')  # 데이터베이스 커넥션 생성
    cur = conn.cursor()  # 커서 확보

    insert_sql = 'INSERT INTO my_class VALUES (?, ?, ?, ?, ?)'

    my_class = [
        ('마마마', '2000.02.04', '서울', '01022452233', 'IOT 자율주행'),
        ('마마마', '2000.02.04', '서울', '01022452233', 'AI 자율주행'),
        ('하마마', '2000.02.04', '서울', '01022452233', 'IOT AI'),
        ('아마마', '2000.02.04', '서울', '01022452233', '자율주행'),
        ('오마마', '2000.02.04', '서울', '01022452233', 'IOT'),
        ('마마마', '2000.02.04', '서울', '01022452233', 'AI'),
        ('김마마', '2000.02.04', '서울', '01089452233', 'IOT AI 자율주행'),
        ('오하하', '2000.02.04', '서울', '01034252233', 'IOT AI 자율주행'),
        ('이무원', '2000.02.04', '서울', '01099452233', 'IOT AI 자율주행'),
        ('김주홍', '2000.02.04', '서울', '01055552233', 'IOT AI 자율주행'),
        ('허승회', '2000.02.04', '서울', '01033352233', 'IOT AI 자율주행')
    ]

    # 여러 데이터 입력
    cur.executemany(insert_sql, my_class)

    conn.commit()       # 데이터베이스 반영

    conn.close()        # 커넥션 닫기

if __name__ == "__main__":		# 외부에서 호출 시
    #insert_books()                  # 데이터 입력 함수 호출
    insert_class()                  # 데이터 입력 함수 호출